laravel/app/Http/Controllers/FileController.php

    public function index()
    {
        return view("files.index", [
            "files" => File::all()
        ]);
---
select * from `files`